queenbee_tamf/app/controllers/projects_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
---
  def show
    @project = Project.find(params[:id])

INSERT INTO `projects` (`name`, `updated_at`, `company_id`, `deleted`, `created_at`) VALUES('wicked', '2009-04-03 15:09:02', 1, 0, '2009-04-03 15:09:02')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save