queenbee_tamf/app/controllers/timesheets_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`id` IN (1,2,3))
SELECT * FROM `timesheets` WHERE (`timesheets`.user_id = 1)
---
  def index
    @timesheets = current_user.timesheets.find(:all, :include => [:project])

SELECT * FROM `timesheets` WHERE (`timesheets`.`id` = 1)
---
  def show
    @timesheet = Timesheet.find(is_amf ? params[0] : params[:id] )

SELECT * FROM `timesheets` WHERE (`timesheets`.`id` = 1)
---
  def edit
    @timesheet = Timesheet.find(params[:id])

INSERT INTO `timesheets` (`project_id`, `updated_at`, `billable_type`, `day`, `description`, `hours`, `user_id`, `created_at`) VALUES(1, '2009-04-03 15:41:01', 'jn', '2009-04-03 16:41:00', 'joseph is brillant and a good coder ', 2, 1, '2009-04-03 15:41:01')
---
  def create
    #@timesheet = Timesheet.new(params[:timesheet])

    if is_amf
      @timesheet = params[0]
      @timesheet.user_id = current_user.id
    else
      @timesheet = current_user.timesheets.build(params[:timesheet])
    end

    respond_to do |format|
      if @timesheet.save