queenbee_tamf/app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `created_at`) VALUES('', '280a601718db605ddaa71f2dd1541ead9a19c26e', '2009-03-28 18:48:55', 'c30fa1fabe70ff6792679877e3cf46068d7db82d', NULL, NULL, 'joseph@vyre.com', '2009-03-28 18:48:55')